{
  "users": [
    {
      "email": "kenzinho@mail.com",
      "password": "$2a$10$YQiiz0ANVwIgpOjYXPxc0O9H2XeX3m8OoY1xk7OGgxTnOJnsZU7FO",
      "name": "Kenzinho",
      "age": 38,
      "id": 1,
      "admin": true
    },
    {
      "email": "grupo3@mail.com",
      "password": "$2a$10$XNuunZ3SoKyZEexwJVcPi.8A3.Y0FFV/Lce8ywJMnbDka5G4bkcBW",
      "id": 2,
      "admin": true
    }
  ],

  "colections": [
    {
      "name": "books_colections",
      "id": 1,
      "series": [
        {
          "name": "fightingfantasy",
          "id": 1,
          "books": [
            {
              "userId": 1,
              "title": "The Citadel of Chaos",
              "author": "Steve Jackson",
              "cover_art": "Emmanuel (1st), Ian Miller (2nd)",
              "interior_art": "Russ Nicholson",
              "sections": 400,
              "published": 1983,
              "id": 1
            },
            {
              "userId": 1,
              "title": "The Warlock of Firetop Mountain",
              "author": "Steve Jackson & Ian Livingstone",
              "cover_art": "Peter Andrew Jones",
              "interior_art": "Russ Nicholson",
              "sections": 400,
              "published": 1982,
              "id": 2
            },
            {
              "userId": 1,
              "title": "The Forest of Doom",
              "author": "Ian Livingstone",
              "cover_art": "Iain McCaig",
              "interior_art": "Malcolm Barter",
              "sections": 400,
              "published": 1983,
              "id": 3
            },
            {
              "userId": 1,
              "title": "A Cidade dos Ladrões",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 4
            },
            {
              "userId": 1,
              "title": "O Calabouço da Morte",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 5
            },
            {
              "userId": 1,
              "title": "A Nave Espacial Traveller",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 6
            },
            {
              "userId": 1,
              "title": "O Templo do Terror",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 7
            },
            {
              "userId": 1,
              "title": "As Coligações de Kether",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 8
            },
            {
              "userId": 1,
              "title": "Mares de Sangue",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 9
            },
            {
              "userId": 1,
              "title": "Encontro Marcado com M.E.D.O.",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 10
            },
            {
              "userId": 1,
              "title": "Planeta Rebelde",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 11
            },
            {
              "userId": 1,
              "title": "Demônios das Profundezas",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 12
            },
            {
              "userId": 1,
              "title": "A Cripta do Vampiro",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 13
            },
            {
              "userId": 1,
              "title": "Robô Comando",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 14
            },
            {
              "userId": 1,
              "title": "Prova dos Campeões",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 15
            },
            {
              "userId": 1,
              "title": "O Guerreiro das Estradas",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 16
            },
            {
              "userId": 1,
              "title": "As Cavernas da Feiticeira da Neve",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 17
            },
            {
              "userId": 1,
              "title": "A Espada do Samurai",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 18
            },
            {
              "userId": 1,
              "title": "O Ladrão da Meia-Noite",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 19
            },
            {
              "userId": 1,
              "title": "Mansão das Trevas",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 20
            },
            {
              "userId": 1,
              "title": "Fantasmas do Medo",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 21
            },
            {
              "userId": 1,
              "title": "O Talismã da Morte",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 22
            },
            {
              "userId": 1,
              "title": "Fortaleza dos Pesadelos",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 23
            },
            {
              "userId": 1,
              "title": "Punhais da Escuridão",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 24
            },
            {
              "userId": 1,
              "title": "A Cripta do Feiticeiro",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 25
            },
            {
              "userId": 1,
              "title": "Exércitos da Morte",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 26
            },
            {
              "userId": 1,
              "title": "Escravos do Abismo",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 27
            },
            {
              "userId": 1,
              "title": "Sky Lord",
              "author": "",
              "cover_art": "",
              "interior_art": "",
              "sections": 400,
              "published": 1983,
              "id": 28
            }
          ]
        },
        {
          "name": "Lord of the Rings",
          "id": 2,
          "books": [
            {
              "userId": 1,
              "title": "The Fellowship of the Ring",
              "author": "J. R. R. Tolkien",
              "cover_art": "",
              "interior_art": "",
              "published": 1954,
              "id": 1
            }
          ]
        }
      ]
    },
    {
      "name": "Rooms&Emulators",
      "id": 2,
      "series": [
        {
          "name": "SNESS",
          "id": 1,
          "games": [
            {
              "userId": 1,
              "title": "'96 Zenkoku Koukou Soccer Senshuken (Japan)",
              "genre": "sports",
              "developer": "",
              "publisher": "",
              "description": "This is a soccer simulation game released only in Japan for the Super Famicom. Not like other soccer games on the SNES, and it has some similarities with Hat trick hero. In addition, you have to play as just one player, instead of controlling the whole team.",
              "id": 1
            },
            {
              "userId": 1,
              "title": "2020 Super Baseball (Japan)",
              "genre": "action, sports, simulation",
              "developer": "",
              "publisher": "",
              "description": "Super Baseball 2020 is set in the future, with robots as characters and human characters with futuristic equipment such as jet-packs and sensors for an advantage in the game. It follows the standard rules of baseball, but with a twist. The field has also been upgraded to be set in the future. ",
              "id": 2
            },
            {
              "userId": 1,
              "title": "2020 Super Baseball (USA)",
              "genre": ["action", "sports", "simulation"],
              "developer": "",
              "publisher": "",
              "description": "2020 Super Baseball takes you into the future of sports... a future taking humans out of the picture completely. Advanced and immersive controls for pitching, batting, catching, and even outfield player control! One of the better baseball games for the SNES hands down. Hours of fun for all, non-sports fans included!",
              "id": 3
            },
            {
              "userId": 1,
              "title": "3 Jigen Kakutou Ballz (Japan)",
              "genre": "",
              "developer": "",
              "publisher": "",
              "description": "",
              "id": 4
            },
            {
              "userId": 1,
              "title": "3 Ninjas Kick Back (USA)",
              "genre": "Beat 'em up, platform",
              "developer": "Malibu Interactive",
              "publisher": "Sony Imagesoft",
              "description": "Fifty years ago, the master samurai fought in a ninja tournament to win a magical dagger that together with an ancient samurai sword, is believed to be the key to unlocking a secret cave laden with riches. After winning the tournament and rightfully gaining the dagger, it was stolen by the master's archrival, Koga. Though the master searched far and wide, he never found any trace of Koga or the dagger. Now, too old to continue searching, the master sends his three young apprentices, the young ninja brothers, Rocky, Colt, and Tum-Tum, to assist him in retrieving the prized dagger. Once it has been restored to its rightful owner, the dagger shall once again be passed along to younger generations, through the winners of the ninja tournament. ",
              "id": 5
            },
            {
              "userId": 1,
              "title": "3x3 Eyes - Juuma Houkan (Japan)",
              "genre": ["action", "sports", "simulation"],
              "developer": "System Supply N-Tech ",
              "publisher": "Banpresto",
              "description": "3x3 Eyes follows the adventures of Pai, the last remaining Sanjiyan Unkara (三只眼 吽迦羅, three-eyed mandala), and her new Wu (Chinese reading of 无; an immortal companion), Yakumo, as they desperately try to find a way to make Pai human so that she can forget her troubled past. Pai travelled to Tokyo searching for the artifact, but shortly after she arrived, a thief snatched her backpack and cane from her. A teenage lad, Yakumo, tackled the crook and managed to get the pack back for her, though the thief escaped with the cane. Yakumo took her to his work, where Pai was able to get cleaned up, and where she discovered that he was the son of Professor Fujii, an archaeologist she had met in Tibet four years prior. The Professor had been researching the legends of the Sanjiyans and had befriended her and offered to help her find the Ningen, only to fall ill and die. Pai had his last letter to his son in her backpack, which asked Yakumo to help Pai with her quest. Although he didn't believe his father's tales of Pai being a monster, he agreed to assist her. Their discussion was interrupted by news reports of a giant monster flying over the city. Pai recognised the creature as her pet Takuhi, who must have been released from his home in Pai's cane by the thief, and who was now looking for her. Pai set out to retrieve him, with Yakumo close behind. However when Yakumo saw Takuhi fly towards Pai, the lad mistook the beast's welcome for an attack, and shoved Pai out the way; immediately Takuhi ripped into the lad, fatally wounding him. Unwilling to lose the boy she had been hunting for and just located, Pai's third eye opened, and she absorbed his soul. This restored his body, but tied him to her as her undead servant. Linked to her, he can only become human again when she becomes human. In the way of this goal are hordes of monsters and demons from the Shadow World, some desiring Pai's powers, others who seek the Ningen for their own. Yakumo can again become mortal and end his constant need to protect Pai because if Pai dies, then so will he. Along the way, they encounter many followers of the now-dead demon god Kaiyanwang, all of whom wish to kill Pai or siphon off her power in order to resurrect their deity and/or gain immortality.",
              "id": 6
            },
            {
              "userId": 1,
              "title": "3x3 Eyes - Seima Kourinden (Japan)",
              "genre": ["action", "sports", "simulation"],
              "developer": "Nova Games",
              "publisher": "Yutaka",
              "description": "3×3 Eyes follows the adventures of Pai, the last remaining Sanjiyan Unkara (三只眼 吽迦羅, three-eyed mandala), and her new Wu (Chinese reading of 无; an immortal companion), Yakumo, as they desperately try to find a way to make Pai human so that she can forget her troubled past. Pai travelled to Tokyo searching for the artifact, but shortly after she arrived, a thief snatched her backpack and cane from her. A teenage lad, Yakumo, tackled the crook and managed to get the pack back for her, though the thief escaped with the cane. Yakumo took her to his work, where Pai was able to get cleaned up, and where she discovered that he was the son of Professor Fujii, an archaeologist she had met in Tibet four years prior. The Professor had been researching the legends of the Sanjiyans and had befriended her and offered to help her find the Ningen, only to fall ill and die. Pai had his last letter to his son in her backpack, which asked Yakumo to help Pai with her quest. Although he didn't believe his father's tales of Pai being a monster, he agreed to assist her. Their discussion was interrupted by news reports of a giant monster flying over the city. Pai recognised the creature as her pet Takuhi, who must have been released from his home in Pai's cane by the thief, and who was now looking for her. Pai set out to retrieve him, with Yakumo close behind. However when Yakumo saw Takuhi fly towards Pai, the lad mistook the beast's welcome for an attack, and shoved Pai out the way; immediately Takuhi ripped into the lad, fatally wounding him. Unwilling to lose the boy she had been hunting for and just located, Pai's third eye opened, and she absorbed his soul. This restored his body, but tied him to her as her undead servant. Linked to her, he can only become human again when she becomes human. In the way of this goal are hordes of monsters and demons from the Shadow World, some desiring Pai's powers, others who seek the Ningen for their own. Yakumo can again become mortal and end his constant need to protect Pai because if Pai dies, then so will he. Along the way, they encounter many followers of the now-dead demon god Kaiyanwang, all of whom wish to kill Pai or siphon off her power in order to resurrect their deity and/or gain immortality.",
              "id": 7
            },
            {
              "userId": 1,
              "title": "3rd Super Robot Wars",
              "genre": "tactical role-playing",
              "developer": "Banpresto",
              "publisher": "Banpresto",
              "description": "The game take place after the 2nd Super Robot Wars, the Divine Crusaders reformed under the leadership of the Zabi family, led by Gihren Zabi, who plans to use the DC to create a dictatorship. However, as the Federation tries to deal with the resurgence of the DC, a new foe appears, the aliens which Bian Zoldark warned of.",
              "id": 8
            },
            {
              "userId": 1,
              "title": "4 Nin Shougi (Japan)",
              "genre": "board game",
              "developer": "Planning Office Wada",
              "publisher": "Planning Office Wada",
              "description": "",
              "id": 9
            },
            {
              "userId": 1,
              "title": "4rd Super Robot Wars",
              "genre": "tactical role-playing",
              "developer": "Banpresto",
              "publisher": "Banpresto",
              "description": "Gameplay of 4th Super Robot Wars is literally similar to its predecessor, Super Robot Wars EX which uses battle sprites for animations. When a stage begins, the character receives introductory dialogue between playable characters, leading to the scenario on the battle field. To complete a scenario, the player must accomplish scenario objectives. Some scenarios are longer, with multi-part missions or have new objectives added as the story unfolds. On battle field, the player and enemy take turns to order their units with commands available, such as movement, attacking, forming squads and casting 'Spirit Commands', a set of magic-like spells unique to each pilot. Once the scenario is cleared, more dialogue is exchanged between characters before the player is taken to an intermission menu. Here, units can be upgraded or optional parts installed, characters' stats and skills can be changed or upgraded, and other maintenance actions can be performed before the player continues on with the game.",
              "id": 10
            },
            {
              "userId": 1,
              "title": "46 Okunen Monogatari - Harukanaru Eden e (Japan)",
              "genre": "",
              "developer": "",
              "publisher": "",
              "description": "",
              "id": 11
            },
            {
              "userId": 1,
              "title": "7th Saga, The (USA)",
              "genre": "role-playing game",
              "developer": "Produce",
              "publisher": "Gameplan21(JP), Enix(NA)",
              "description": "The game takes place on a world called Ticondera. Five thousand years before the beginning of the story, a divine being named Saro defeated an evil entity named Gorsia with the power of seven runes. In the years since then, the runes have been scattered across the globe. Lemele (Remeer in the Japanese version), the son of Saro, was born 100 years before the beginning of the game, and became a hero when he defeated the demon Gariso. Now 100 years old, Lemele has become the benevolent and powerful ruler of the world. The seven characters are recruited from various walks of life and corners of the globe by the elderly King Lemele. After 5 years of training at his palace, Lemele dispatches his seven apprentices in a quest for the seven runes. Each rune possesses a great power that can be used by the person who wields it. The one who collects all seven runes will become Lemele's heir. To find the runes, the king gives each character a Crystal Ball to assist them in their search. Retrieving the runes means confronting the various powerful tyrants who have come to possess them, including wizards, kings, and dragons. The apprentices are also being hunted by a persistent bounty hunter named Pison (Python in the Japanese version), who has been hired by one of the apprentices to eliminate the rest (the identity of the 'traitor' apprentice is randomized with each new game). After defeating a resurrected Gariso and collecting all seven runes, the player is confronted by Lemele, who reveals that he is actually Gorsia. Gorsia traveled to the present from 5,000 years in the past, killed Lemele and took his identity, then recruited the seven apprentices to locate the runes for him. The power each rune contains is actually a trapped portion of Gorsia's power. Gorsia destroys the runes, re-absorbs his lost power, and zaps the player with lightning, sending them to a strange, unfamiliar world which turns out to be Ticondera 5,000 years in the past. After passing through several towns, the player eventually ends up in the technologically advanced city of Melenam, which was originally explored as ruins by the player early in the game. Melenam is revealed to be the origin of the Tetsujin robots, and the player witnesses the destruction of the city at the hands of a rogue super-Tetsujin created by the city's scientists for the purposes of fighting Gorsia. The player eventually learns that although Saro had recently defeated Gorsia, Gorsia has returned from the future and fatally wounded Saro. Saro's disciples give the player the seven runes, which the player uses to seal Gorsia's powers and eventually defeat the evil being. The dying Gorsia kills the player in one last act of revenge, but 4,900 years later Saro reincarnates the player's soul as a young baby and Saro's son: none other than Lemele. ",
              "id": 12
            },
            {
              "userId": 1,
              "title": "7th Saga, The (USA) [Hack by James Skarzinskas v1.0] (Elnard's Balance Restauration)",
              "genre": "",
              "developer": "",
              "publisher": "",
              "description": "",
              "id": 13
            },
            {
              "userId": 1,
              "title": "7th Saga, The (USA) [Hack by Nati v1.0] (~7th Saga Redux)",
              "genre": "",
              "developer": "",
              "publisher": "",
              "description": "",
              "id": 14
            },
            {
              "userId": 1,
              "title": "90 Minutes - European Prime Goal (Europe)",
              "genre": "",
              "developer": "Namco",
              "publisher": "Namco(JP), Ocean Software(EU)",
              "description": "",
              "id": 15
            },
            {
              "userId": 1,
              "title": "90 Minutes - European Prime Goal (Europe) (Beta)",
              "genre": "",
              "developer": "",
              "publisher": "",
              "description": "",
              "id": 16
            },
            {
              "userId": 1,
              "title": "AAAHH!!! Real Monsters (Europe)",
              "genre": "",
              "developer": "Realtime Associates",
              "publisher": "Viacom New Media",
              "description": "In order to graduate from Monster Academy, three young monsters, Ickis, Oblina, and Krumm, need to pass their Monster Midterm Exam. This test has them scaring a number of people that their headmaster, the Gromble, orders them to scare in order to pass the exam.",
              "id": 17
            }
          ]
        }
      ]
    }
  ]
}
